In [30]:
In [1]: import sqlite3
 
In [2]: connection = sqlite3.connect('books.db')

In [31]:
# Import the pandas module
import pandas as pd

# Set the maximum number of columns to be displayed to 10
pd.options.display.max_columns = 10

# Use the read_sql function from pandas to execute a SQL query and store the result in a DataFrame
# The SQL query selects all records from the 'authors' table in the database
df = pd.read_sql('SELECT * FROM authors', connection, index_col=['id'])

In [32]:

# The SQL query selects all records from the 'titles' table in the database

df = pd.read_sql('SELECT * FROM titles', connection)

In [33]:
df.head()

         isbn                             title  edition copyright
0  0135404673     Intro to Python for CS and DS        1      2020
1  0132151006     Internet & WWW How to Program        5      2012
2  0134743350               Java How to Program       11      2018
3  0133976890                  C How to Program        8      2016
4  0133406954  Visual Basic 2012 How to Program        6      2014

In [34]:
# Use the read_sql function from pandas to execute a SQL query and store the result in a DataFrame
# The SQL query selects the 'first' and 'last' columns from the 'authors' table in the database
df = pd.read_sql('SELECT first, last FROM authors', connection)

In [35]:
df.head()

       first    last
0       Paul  Deitel
1     Harvey  Deitel
2      Abbey  Deitel
3        Dan   Quirk
4  Alexander    Wald

In [36]:

# The SQL query selects the 'title' column from the 'titles' table in the database
# The results are ordered in ascending order by the 'title'ase
df = pd.read_sql('SELECT title FROM titles ORDER BY title ASC', connection)

In [37]:


# Now you can use pandas (as 'pd') in your script
df = pd.read_sql('''SELECT isbn, title, edition, copyright
                   FROM titles
                   WHERE title LIKE '%How to Program'
                   ORDER BY title''', connection)

In [38]:

# The SQL query selects the 'first', 'last', and 'isbn' columns from the 'authors' and 'author_ISBN' tables in the database
# It uses an INNER JOIN to merge rows from both tables where the 'id' column matches
df = pd.read_sql('''SELECT first, last, isbn
                   FROM authors
                   INNER JOIN author_ISBN
                       ON authors.id = author_ISBN.id
                   ORDER BY last, first''', connection).head()

In [39]:
# The Cursor object is used to execute SQL commands
cursor = connection.cursor()

In [40]:
# The 'index_col' parameter specifies that the 'id' column from the 'authors' table should be used as the index of the DataFrame
df = pd.read_sql('SELECT id, first, last FROM authors', connection, index_col=['id'])

In [43]:
# Create a cursor object using the connection
cursor = connection.cursor()

# Execute an SQL statement to insert a new author into the authors table
# The SQL keywords INSERT INTO are followed by the table in which to insert the new row and a comma-separated list of column names in parentheses.


cursor.execute('''INSERT INTO authors (first, last)
                  VALUES ('Sue', 'Red')''')

In [44]:
# Create a cursor object using the connection
cursor = connection.cursor()

# Execute an SQL statement to update the 'last' name of the author 'Sue' in the authors table
# The SQL keywords UPDATE are followed by the table in which to update the row and a SET clause that specifies the column to update and the new value.
# The WHERE clause specifies which rows to update, in this case, rows where 'last' is 'Red' and 'first' is 'Sue'.
cursor.execute('''UPDATE authors SET last='Black'
                  WHERE last='Red' AND first='Sue' ''')

# Commit the transaction
connection.commit()

In [46]:


# Execute an SQL statement to delete the author with id 6 from the authors table
# The SQL keywords DELETE FROM are followed by the table from which to delete the row.
# The WHERE clause specifies which rows to delete, in this case, the row where 'id' is 6.
cursor.execute('DELETE FROM authors WHERE id=6')

# Commit the transaction
connection.commit()

# Check the number of rows affected by the DELETE operation
print("Number of rows deleted: ", cursor.rowcount)

# Execute an SQL query to fetch the updated authors data
df = pd.read_sql('SELECT id, first, last FROM authors', connection, index_col=['id'])

# Print the DataFrame
print(df)

Number of rows deleted:  0
        first    last
id
1        Paul  Deitel
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald
7         Sue   Black
8         Sue   Black
9         Sue   Black
10        Sue   Black
11        Sue   Black